Infineon/mtb-example-psoc-edge-secure-smif-access/proj_cm33_s/main.c
/******************************************************************************
* File Name:   main.c
*
* Description: This is the source code for CM33 Secure Project.
*
* Related Document: See README.md
*
*
*******************************************************************************
 (c) 2023-2025, Infineon Technologies AG, or an affiliate of Infineon Technologies AG. All rights reserved.
 This software, associated documentation and materials ("Software") is owned by
 Infineon Technologies AG or one of its affiliates ("Infineon") and is protected
 by and subject to worldwide patent protection, worldwide copyright laws, and
 international treaty provisions. Therefore, you may use this Software only as
 provided in the license agreement accompanying the software package from which
 you obtained this Software. If no license agreement applies, then any use,
 reproduction, modification, translation, or compilation of this Software is
 prohibited without the express written permission of Infineon.
 Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
 IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING,
 BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF THIRD-PARTY RIGHTS AND
 IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A SPECIFIC USE/PURPOSE OR
 MERCHANTABILITY. Infineon reserves the right to make changes to the Software
 without notice. You are responsible for properly designing, programming, and
 testing the functionality and safety of your intended application of the
 Software, as well as complying with any legal requirements related to its
 use. Infineon does not guarantee that the Software will be free from intrusion,
 data theft or loss, or other breaches ("Security Breaches"), and Infineon
 shall have no liability arising out of any Security Breaches. Unless otherwise
 explicitly approved by Infineon, the Software may not be used in any application
 where a failure of the Product or any consequences of the use thereof can
 reasonably be expected to result in personal injury.
*******************************************************************************/

/*******************************************************************************
* Header Files
*******************************************************************************/

#include "cy_pdl.h"
#include "cybsp.h"
#include "mtb_serial_memory.h"
/*****************************************************************************
* Macros
******************************************************************************/
#define CM33_NS_APP_BOOT_ADDR         (CYMEM_CM33_0_m33_nvm_START + CYBSP_MCUBOOT_HEADER_SIZE) 


/*******************************************************************************
* Function Name: handle_app_error
********************************************************************************
* Summary:
* User defined error handling function
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
__STATIC_INLINE void handle_app_error(void)
{
    /* Disable all interrupts. */
    __disable_irq();

    CY_ASSERT(0);

    /* Infinite loop */
    while(true);

}

/*****************************************************************************
* Function Name: main
******************************************************************************
* This is the main function for Cortex M33 CPU secure application
* NOTE: CM33 secure project assumes that certain memory and peripheral regions
* will be accessed from non-secure environment by the CM33 NS /CM55 code,
* For such regions MPC and PPC configurations are applied by cybsp_init to make 
* it non-secure. Any access to these regions from the secure side is recommended 
* to be done before the MPC/PPC configuration is applied.Once a memory or 
* peripheral region is marked as non secure it cannot be accessed from the secure 
* side using secure aliased address but may be accessed using non secure aliased 
* address
*****************************************************************************/
int main(void)
{
    uint32_t ns_stack;
    cy_cmse_funcptr NonSecure_ResetHandler;
    cy_rslt_t result;
    cy_stc_smif_mem_context_t mem_context;
    cy_stc_smif_mem_info_t mem_info;
    mtb_serial_memory_t serial_memory_obj;

    /* Set up internal routing, pins, and clock-to-peripheral connections */
    result = cybsp_init();

    /* Board initialization failed. Stop program execution */
    if (CY_RSLT_SUCCESS != result)
    {
        handle_app_error();
    }

    /* Enable global interrupts */
    __enable_irq();

    ns_stack = (uint32_t)(*((uint32_t*)CM33_NS_APP_BOOT_ADDR));
    __TZ_set_MSP_NS(ns_stack);
    
    NonSecure_ResetHandler = (cy_cmse_funcptr)(*((uint32_t*)(CM33_NS_APP_BOOT_ADDR + 4)));
    
    
    /*Initialize smif from secure domain*/ 
    result = mtb_serial_memory_setup(&serial_memory_obj, 
                                     MTB_SERIAL_MEMORY_CHIP_SELECT_1, 
                                     CYBSP_SMIF_CORE_0_XSPI_FLASH_hal_config.base, 
                                     CYBSP_SMIF_CORE_0_XSPI_FLASH_hal_config.clock, 
                                     &mem_context, 
                                     &mem_info, 
                                     &smif0BlockConfig);
                                     
    if (CY_RSLT_SUCCESS != result)
    {
        handle_app_error();
    }
    
    
    if (CY_RSLT_SUCCESS != result)
    {
        handle_app_error();
    }
    
    /*Initialize MemNum for non secure access*/
    result = Cy_SMIF_MemNumInit(SMIF0_CORE, &smif0BlockConfig, &mem_context);
    if (CY_RSLT_SUCCESS != result)
    {
        handle_app_error();
    }

    /*Apply peripheral security configuration*/
    Cy_PPC0_Init();
    Cy_PPC1_Init();
          
    /* Start non-secure application */
    NonSecure_ResetHandler();
    
    for (;;)
    {
    }
}
/* [] END OF FILE */

